{
  "data": {
    "name": "Carlos Pérez",
    "role": "Software Engineer",
    "address": "Zulia, Venezuela (GMT-4)",
    "email": "danielperandrad10@gmail.com",
    "phone": "(+58) 412 1081136",
    "links": [
      {
        "name": "Portfolio",
        "url": "https://carlosperez.xyz"
      },
      {
        "name": "LinkedIn",
        "url": "https://www.linkedin.com/in/carlosdp7"
      },
      {
        "name": "Github",
        "url": "https://github.com/carlosdp7"
      }
    ],
    "profile": [
      "Software Engineer with more than 3 years of experience developing technological solutions for companies from different industries using technologies such as Node.js, Express.js, MongoDB, and React.js. I focus on developing high-quality, scalable, and maintainable software that meets customer requirements and provides an excellent user experience.",
      "I am passionate about technology and how it can transform our world. This is why I am always aware of the latest technological trends and always look for ways to apply them in my work.",
      "I have skills in problem-solving, task organization, and time management. I like working in a team and collaborating with other engineers and designers to create innovative and effective solutions. I am proud to say that I have worked on successful projects and helped companies achieve technological goals.",
      "I promise to continue learning and improving my technical and professional skills. If you are looking for an experienced and committed Software Engineer, please do not hesitate to contact me."
    ],
    "academic": [
      {
        "school": "Universidad Alonso de Ojeda",
        "degree": "Bachelor's degree",
        "fieldOfStudy": "Computer Engineering",
        "startDate": "Jan 2019",
        "endDate": "Mar 2023"
      }
    ],
    "experience": [
      {
        "title": "Software Engineer",
        "companyName": "Aurora Studio",
        "location": "Carlifornia, United States",
        "startDate": "November 2019",
        "endDate": "Present",
        "time": "3 yrs 5 mos",
        "description": [
            "I designed a system capable of exchanging, buying and selling collectible cards implementing the microservices architecture.",
            "I developed a real-time chat which increased the communication between the user and the administrator by 100%.",
            "I implemented an optimal solution for a credit simulator which is capable of supporting more than 50 thousand vehicles.",
            "I managed to successfully integrate different types of third-party APIs (Google Maps, Stripe, Shopify, etc) which increased development time considerably.",
            "We managed to finalize a delivery system working as a team, meeting deadlines and obtaining 100% customer satisfaction.",
            "I met with clients to understand their needs in order to develop and improve the end user experience.",
            "Tech-Stack: Docker, Kubernetes, Redis, Web Scraping, Microservices, Node.js, TypeScript, React.js, Gatsby.js, Next.js, Bootstrap, REST APIs, Git, GitHub, Jest, Playwright, MongoDB, Express.js, Socket.io."
        ]
      }
    ],
    "projects": [
      {
        "title": "Platzi Punks",
        "description": [
            "Development of a system capable of mint Non Fungible Tokens using the standard ERC721 of Open Zeppelin.",
            "Tech-Stack: React.js, Solidity, Hardhat, Metamask, Web3.js, Ethers.js."
        ]
      }
    ],
    "skills": {
      "programmingLaguanges": [
        "JavaScript",
        "TypeScript",
        "Solidity"
      ],
      "frameworksAndTools": [
        "Docker",
        "Kubernetes",
        "Redis",
        "Web Scraping",
        "Microservices",
        "Node.js",
        "React.js",
        "Gatsby.js",
        "Next.js",
        "Bootstrap",
        "HTML",
        "HTML5",
        "CSS",
        "REST APIs",
        "JSON",
        "Axios",
        "Git",
        "Github",
        "Unit Testing",
        "Jest",
        "Playwright",
        "MongoDB",
        "Express.js",
        "Web Socket",
        "Socket.io"
      ],
      "soft": [
        "Resilience",
        "Adaptability",
        "Teamwork"
      ],
      "agile": [
        "SCRUM" 
      ]
    },
    "interest": [
      "TypeScript",
      "JavaScript",
      "Backend",
      "Microservices",
      "Solidity"
    ],
    "languages": [
      "English (Intermediate)",
      "Spanish (Native)"
    ]
  }
}